        IDENTIFICATION DIVISION.
        PROGRAM-ID. MON-INFO.
        PROCEDURE DIVISION.
            DISPLAY "Mon nom est Aquilas".
            DISPLAY "J'ai 24 ans".
            STOP RUN.
